In [1]:
import pandas as pd 
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
import scipy.stats as stats
import statsmodels.api as sm
from statsmodels .formula .api import ols
from statsmodels.stats.multicomp import pairwise_tukeyhsd

In [112]:
df1 = pd.read_csv(r'C:\Users\hp\Downloads\stats project\Golf.csv')
df1.head()

   Current  New
0      264  277
1      261  269
2      267  263
3      272  266
4      258  262

In [113]:
df2 = pd.read_csv(r'C:\Users\hp\Downloads\stats project\Laliga.csv' , header = None )
df2.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Pos,Team,Seasons,Points,GamesPlayed,GamesWon,GamesDrawn,GamesLost,GoalsFor,GoalsAgainst,Champion,Runner-up,Third,Fourth,Fifth,Sixth,T,Debut,Since/LastApp,BestPosition
2,1,Real Madrid,86,4385,2762,1647,552,563,5947,3140,33,23,8,8,3,4,79,1929,1929,1
3,2,Barcelona,86,4262,2762,1581,573,608,5900,3114,25,25,12,12,4,6,83,1929,1929,1
4,3,Atletico Madrid,80,3442,2614,1241,598,775,4534,3309,10,8,16,9,7,6,56,1929,2002-03,1

In [114]:
df2.columns = df2.loc[1 ,:]
df2 = df2.drop([0,1])
df2

1,Pos,Team,Seasons,Points,GamesPlayed,GamesWon,GamesDrawn,GamesLost,GoalsFor,GoalsAgainst,Champion,Runner-up,Third,Fourth,Fifth,Sixth,T,Debut,Since/LastApp,BestPosition
2,1,Real Madrid,86,4385,2762,1647,552,563,5947,3140,33,23,8,8,3,4,79,1929,1929,1
3,2,Barcelona,86,4262,2762,1581,573,608,5900,3114,25,25,12,12,4,6,83,1929,1929,1
4,3,Atletico Madrid,80,3442,2614,1241,598,775,4534,3309,10,8,16,9,7,6,56,1929,2002-03,1
5,4,Valencia,82,3386,2664,1187,616,861,4398,3469,6,6,10,11,10,7,50,1931-32,1987-88,1
6,5,Athletic Bilbao,86,3368,2762,1209,633,920,4631,3700,8,7,10,5,8,10,49,1929,1929,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
58,57,Xerez,1,34,38,8,10,20,38,66,-,-,-,-,-,-,-,2009-10,2009-10,20
59,58,Condal,1,22,30,7,8,15,37,57,-,-,-,-,-,-,-,1956-57,1956-57,16
60,59,Atletico Tetuan,1,19,30,7,5,18,51,85,-,-,-,-,-,-,-,1951-52,1951-52,16
61,60,Cultural Leonesa,1,14,30,5,4,21,34,65,-,-,-,-,-,-,-,1955-56,1955-56,15
62,61,Girona,1,-,-,-,-,-,-,-,-,-,-,-,-,-,-,2017-18,2017-18,9

### 1. You were recently hired as a business analyst in a top sports company. The senior management team has asked you to come up with metrics with which they can gauge which team will win the upcoming La Liga cup (Football tournament). The given data set contains information on all the teams that have so far participated in all the past tournaments. It has data about how many goals each team scored, conceded; how many times they came within the first 6 positions, how many seasons they have qualified, their best position in the past, etc. You are required to do the following:

### Before doing any analysis it would be a good idea to check for any hypens or other symbols the data set and make appropriate replacements to make sure you can perform arithmetic operations on the data. Prepare a short report to answer the following questions:

### 1.	Which are the teams which started playing between 1930-1980?

### 2.	Which are the top 5 teams in terms of points?

### 3.	What is the distribution of the winning percentage for all teams? Which teams are in the top 5 in terms of winning percentage? (Winning percentage= (GamesWon / GamesPlayed)*100)

### 4.	Is there a significant difference in the winning percentage for teams which have attained a best position between 1-3 and those teams which have had a best position between 4-7.

In [115]:
df2.shape

(61, 20)

In [116]:
df2.info()
## there is  no nullvalues

<class 'pandas.core.frame.DataFrame'>
Int64Index: 61 entries, 2 to 62
Data columns (total 20 columns):
Pos              61 non-null object
Team             61 non-null object
Seasons          61 non-null object
Points           61 non-null object
GamesPlayed      61 non-null object
GamesWon         61 non-null object
GamesDrawn       61 non-null object
GamesLost        61 non-null object
GoalsFor         61 non-null object
GoalsAgainst     61 non-null object
Champion         61 non-null object
Runner-up        61 non-null object
Third            61 non-null object
Fourth           61 non-null object
Fifth            61 non-null object
Sixth            61 non-null object
T                61 non-null object
Debut            61 non-null object
Since/LastApp    61 non-null object
BestPosition     61 non-null object
dtypes: object(20)
memory usage: 10.0+ KB

In [117]:
## lets check  for  anomalies

In [227]:
for i in df2.columns:
    
    print(i ,df2[i].unique(), df2[i].nunique() )

Pos ['1' '2' '3' '4' '5' '6' '7' '8' '9' '10' '11' '12' '13' '14' '15' '16'
 '17' '18' '19' '20' '21' '22' '23' '24' '25' '26' '27' '28' '29' '30'
 '31' '32' '33' '34' '35' '36' '37' '38' '39' '40' '41' '42' '43' '44'
 '45' '46' '47' '48' '49' '50' '51' '52' '53' '54' '55' '56' '57' '58'
 '59' '60' '61'] 61
Team ['Real Madrid' 'Barcelona' 'Atletico Madrid' 'Valencia' 'Athletic Bilbao'
 'Sevilla' 'Espanyol' 'Real Sociedad' 'Zaragoza' 'Real Betis'
 'Deportivo La Coruna' 'Celta Vigo' 'Valladolid' 'Racing Santander'
 'Sporting Gijon' 'Osasuna' 'Malaga' 'Oviedo' 'Mallorca' 'Las Palmas'
 'Villarreal' 'Granada' 'Rayo Vallecano' 'Elche' 'Getafe' 'Hercules'
 'Tenerife' 'Murcia' 'Alaves' 'Levante' 'Salamanca' 'Sabadell' 'Cadiz'
 'Logrones' 'Castellon' 'Albacete' 'Almeria' 'Cordoba' 'Compostela'
 'Recreativo' 'Burgos CF' 'Pontevedra' 'Numancia' 'Eibar' 'Arenas'
 'Real Burgos' 'Gimnastic' 'Extremadura' 'Merida' 'Alcoyano' 'Jaen'
 'Real Union' 'AD Almeria' 'Europa' 'Lleida' 'Leganes' 'Xerez' 'Condal'
 'Atletico Tetuan' 'Cultural Leonesa' 'Girona'] 61
Seasons ['86' '80' '82' '73' '70' '58' '51' '45' '42' '44' '43' '37' '36' '38'
 '27' '33' '17' '23' '21' '12' '20' '13' '18' '11' '14' '9' '7' '6' '4'
 '5' '3' '2' '1'] 33
Points ['4385' '4262' '3442' '3386' '3368' '2819' '2792' '2573' '2109' '1884'
 '1814' '1789' '1471' '1416' '1389' '1351' '1314' '1174' '1148' '1020'
 '970' '667' '662' '606' '553' '538' '510' '445' '421' '416' '375' '353'
 '343' '293' '285' '277' '242' '230' '190' '188' '168' '150' '148' '132'
 '107' '96' '91' '83' '81' '76' '71' '56' '52' '42' '40' '35' '34' '22'
 '19' '14' '-'] 61
GamesPlayed ['2762' '2614' '2664' '2408' '2626' '2302' '1986' '1728' '1530' '1698'
 '1466' '1428' '1458' '1318' '1255' '1192' '988' '1096' '646' '742' '652'
 '678' '456' '628' '494' '586' '380' '402' '423' '426' '448' '346' '334'
 '270' '228' '282' '160' '186' '204' '180' '152' '114' '130' '116' '80'
 '108' '90' '72' '68' '54' '38' '30' '-'] 53
GamesWon ['1647' '1581' '1241' '1187' '1209' '990' '948' '864' '698' '606' '563'
 '586' '463' '453' '471' '426' '390' '408' '333' '367' '266' '218' '189'
 '203' '147' '184' '155' '145' '125' '113' '123' '129' '104' '96' '103'
 '76' '62' '82' '52' '50' '59' '53' '37' '35' '43' '26' '34' '20' '19'
 '30' '29' '21' '17' '18' '13' '8' '7' '5' '-'] 59
GamesDrawn ['552' '573' '598' '616' '633' '531' '608' '577' '522' '440' '392' '389'
 '384' '336' '358' '327' '330' '292' '256' '242' '172' '175' '148' '180'
 '112' '149' '128' '143' '81' '95' '102' '127' '92' '79' '76' '56' '63'
 '45' '46' '50' '44' '37' '27' '21' '16' '23' '24' '13' '14' '18' '6' '11'
 '10' '8' '5' '4' '-'] 57
GamesLost ['563' '608' '775' '861' '920' '887' '1070' '766' '682' '575' '723' '619'
 '639' '629' '565' '535' '492' '399' '487' '208' '349' '305' '295' '197'
 '211' '298' '174' '194' '198' '202' '217' '158' '152' '118' '110' '137'
 '63' '90' '95' '83' '78' '52' '66' '44' '37' '62' '48' '33' '30' '41'
 '19' '20' '15' '18' '21' '-'] 56
GoalsFor ['5947' '5900' '4534' '4398' '4631' '3680' '3609' '3228' '2683' '2159'
 '2052' '2278' '1767' '1843' '1753' '1500' '1421' '1642' '1182' '1347'
 '892' '819' '760' '750' '520' '716' '619' '607' '458' '430' '422' '492'
 '393' '291' '419' '320' '244' '285' '199' '202' '216' '165' '155' '139'
 '227' '101' '181' '62' '70' '145' '121' '153' '71' '97' '36' '38' '37'
 '51' '34' '-'] 60
GoalsAgainst ['3140' '3114' '3309' '3469' '3700' '3373' '3889' '3230' '2847' '2492'
 '2188' '2624' '2180' '2368' '2152' '1834' '1763' '1951' '1371' '1746'
 '789' '1157' '1088' '1022' '633' '1050' '744' '992' '623' '632' '581'
 '720' '662' '489' '588' '410' '366' '430' '241' '296' '310' '221' '253'
 '167' '308' '139' '295' '117' '115' '252' '183' '184' '116' '131' '182'
 '55' '66' '57' '85' '65' '-'] 61
Champion ['33' '25' '10' '6' '8' '1' '-' '2'] 8
Runner-up ['23' '25' '8' '6' '7' '4' '-' '3' '1' '5'] 10
Third ['8' '12' '16' '10' '4' '2' '-' '1' '3'] 9
Fourth ['8' '12' '9' '11' '5' '3' '1' '2' '-'] 9
Fifth ['3' '4' '7' '10' '8' '12' '2' '-' '1'] 9
Sixth ['4' '6' '7' '10' '5' '3' '1' '2' '-'] 9
T ['79' '83' '56' '50' '49' '32' '16' '19' '18' '14' '12' '11' '3' '5' '7'
 '6' '2' '9' '-' '1' '4'] 21
Debut ['1929' '1931-32' '1934-35' '1939-40' '1932-33' '1941-42' '1948-49'
 '1944-45' '1935-36' '1949-50' '1933-34' '1960-61' '1951-52' '1998-99'
 '1977-78' '1959-60' '2004-05' '1961-62' '1940-41' '1930-31' '1963-64'
 '1974-75' '1943-44' '1987-88' '1991-92' '2007-08' '1962-63' '1994-95'
 '1978-79' '1971-72' '1999-00' '2014-15' '1990-91' '1947-48' '1996-97'
 '1995-96' '1945-46' '1953-54' '1979-80' '1950-51' '2016-17' '2009-10'
 '1956-57' '1955-56' '2017-18'] 45
Since/LastApp ['1929' '2002-03' '1987-88' '2001-02' '1994-95' '2010-11' '2012-13'
 '2015-16' '2014-15' '2013-14' '2011-12' '2016-17' '2008-09' '2000-01'
 '2009-10' '2007-08' '1998-99' '2005-06' '1996-97' '1990-91' '2004-05'
 '1997-98' '1979-80' '1969-70' '1934-35' '1992-93' '2006-07' '1950-51'
 '1957-58' '1931-32' '1980-81' '1930-31' '1993-94' '1956-57' '1951-52'
 '1955-56' '2017-18'] 37
BestPosition ['1' '3' '2' '4' '6' '8' '5' '11' '7' '12' '10' '17' '9' '19' '14' '16'
 '20' '15'] 18
deb1 [1929 1931 1934 1939 1932 1941 1948 1944 1935 1949 1933 1960 1951 1998
 1977 1959 2004 1961 1940 1930 1963 1974 1943 1987 1991 2007 1962 1994
 1978 1971 1999 2014 1990 1947 1996 1995 1945 1953 1979 1950 2016 2009
 1956 1955 2017] 45

In [228]:
for i in df2.columns :
    if('-'  in list(df2[i]) ):
        print(i)
    else :
        print('not matching')
        
## here are the list of columns  where '-' is present

not matching
not matching
not matching
Points
GamesPlayed
GamesWon
GamesDrawn
GamesLost
GoalsFor
GoalsAgainst
Champion
Runner-up
Third
Fourth
Fifth
Sixth
T
not matching
not matching
not matching
not matching

In [229]:
df2['Champion'].value_counts()

-     52
1      3
6      1
10     1
33     1
2      1
25     1
8      1
Name: Champion, dtype: int64

In [230]:
# now  we can replace '-' with np.nan
df3 = df2.replace('-' , 0)

In [231]:
df3.isnull().sum()

1
Pos              0
Team             0
Seasons          0
Points           0
GamesPlayed      0
GamesWon         0
GamesDrawn       0
GamesLost        0
GoalsFor         0
GoalsAgainst     0
Champion         0
Runner-up        0
Third            0
Fourth           0
Fifth            0
Sixth            0
T                0
Debut            0
Since/LastApp    0
BestPosition     0
deb1             0
dtype: int64

### 1. Which are the teams which started playing between 1930-1980?¶

In [232]:
df3.columns

Index(['Pos', 'Team', 'Seasons', 'Points', 'GamesPlayed', 'GamesWon',
       'GamesDrawn', 'GamesLost', 'GoalsFor', 'GoalsAgainst', 'Champion',
       'Runner-up', 'Third', 'Fourth', 'Fifth', 'Sixth', 'T', 'Debut',
       'Since/LastApp', 'BestPosition', 'deb1'],
      dtype='object', name=1)

In [233]:
df3['deb1'] =df3['Debut'].str.split('-')

In [234]:
df2['deb1']

2     1929
3     1929
4     1929
5     1931
6     1929
      ...
58    2009
59    1956
60    1951
61    1955
62    2017
Name: deb1, Length: 61, dtype: object

In [235]:
for i in df2['deb1']:
    if (i>1930 and i<1980):
        print(i)

1931
1934
1939
1932
1941
1939
1948
1944
1935
1949
1933
1960
1951
1941
1977
1959
1935
1961
1940
1963
1974
1943
1977
1941
1962
1978
1971
1963
1947
1945
1953
1979
1950
1956
1951
1955

In [239]:
df3.columns

Index(['Pos', 'Team', 'Seasons', 'Points', 'GamesPlayed', 'GamesWon',
       'GamesDrawn', 'GamesLost', 'GoalsFor', 'GoalsAgainst', 'Champion',
       'Runner-up', 'Third', 'Fourth', 'Fifth', 'Sixth', 'T', 'Debut',
       'Since/LastApp', 'BestPosition', 'deb1'],
      dtype='object', name=1)

In [241]:
df3.deb1

2         [1929]
3         [1929]
4         [1929]
5     [1931, 32]
6         [1929]
         ...
58    [2009, 10]
59    [1956, 57]
60    [1951, 52]
61    [1955, 56]
62    [2017, 18]
Name: deb1, Length: 61, dtype: object

In [218]:
 df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 61 entries, 2 to 62
Data columns (total 21 columns):
Pos              61 non-null object
Team             61 non-null object
Seasons          61 non-null object
Points           61 non-null object
GamesPlayed      61 non-null object
GamesWon         61 non-null object
GamesDrawn       61 non-null object
GamesLost        61 non-null object
GoalsFor         61 non-null object
GoalsAgainst     61 non-null object
Champion         61 non-null object
Runner-up        61 non-null object
Third            61 non-null object
Fourth           61 non-null object
Fifth            61 non-null object
Sixth            61 non-null object
T                61 non-null object
Debut            61 non-null object
Since/LastApp    61 non-null object
BestPosition     61 non-null object
deb1             61 non-null object
dtypes: object(21)
memory usage: 13.0+ KB

In [236]:
def format_year(x):
    if len(x)>1:
        if int(x[0])<1999:
            return [x[0],int(x[1])+1900]
        else:
            return [x[0],int(x[1])+2000]
    else:
        return x

In [237]:
def yy_yyyy(x):
    if len(x) > 1:
        
        if int(x[0])<1999:
            return[x[0] , int(x[1])+1900 ]
        else:
            return[x[0] , int(x[1]) + 2000]
    else:
        return x

In [242]:
df3['deb1'] =  df3['deb1'].apply (yy_yyyy)

In [243]:
df3['deb1']

2           [1929]
3           [1929]
4           [1929]
5     [1931, 1932]
6           [1929]
          ...
58    [2009, 2010]
59    [1956, 1957]
60    [1951, 1952]
61    [1955, 1956]
62    [2017, 2018]
Name: deb1, Length: 61, dtype: object

In [254]:
def cd(x):
    if len(x) ==1:
        return int(x[0]) >=1930 and int(x[0])<=1980
    else:
        return ((int(x[0] )>=1930 and int(x[0])<=1980) or(int(x[1] )>=1930 and int(x[1])<=1980))

In [255]:
### teams who debuted between 1930 and 1980
df3[df3['deb1'].apply(cd)]['Team']

5                Valencia
7                 Sevilla
10               Zaragoza
11             Real Betis
12    Deportivo La Coruna
13             Celta Vigo
14             Valladolid
16         Sporting Gijon
17                Osasuna
18                 Malaga
19                 Oviedo
20               Mallorca
21             Las Palmas
23                Granada
24         Rayo Vallecano
25                  Elche
27               Hercules
28               Tenerife
29                 Murcia
30                 Alaves
31                Levante
32              Salamanca
33               Sabadell
34                  Cadiz
36              Castellon
39                Cordoba
41             Recreativo
42              Burgos CF
43             Pontevedra
48              Gimnastic
51               Alcoyano
52                   Jaen
54             AD Almeria
56                 Lleida
59                 Condal
60        Atletico Tetuan
61       Cultural Leonesa
Name: Team, dtype: object

In [ ]:
df_new[df_new['Debut_temp'].apply(check_debut)]['Team']

###  2. Which are the top 5 teams in terms of points?

In [256]:
df3.columns

Index(['Pos', 'Team', 'Seasons', 'Points', 'GamesPlayed', 'GamesWon',
       'GamesDrawn', 'GamesLost', 'GoalsFor', 'GoalsAgainst', 'Champion',
       'Runner-up', 'Third', 'Fourth', 'Fifth', 'Sixth', 'T', 'Debut',
       'Since/LastApp', 'BestPosition', 'deb1'],
      dtype='object', name=1)

In [257]:
df3.head()

1,Pos,Team,Seasons,Points,GamesPlayed,GamesWon,GamesDrawn,GamesLost,GoalsFor,GoalsAgainst,...,Runner-up,Third,Fourth,Fifth,Sixth,T,Debut,Since/LastApp,BestPosition,deb1
2,1,Real Madrid,86,4385,2762,1647,552,563,5947,3140,...,23,8,8,3,4,79,1929,1929,1,[1929]
3,2,Barcelona,86,4262,2762,1581,573,608,5900,3114,...,25,12,12,4,6,83,1929,1929,1,[1929]
4,3,Atletico Madrid,80,3442,2614,1241,598,775,4534,3309,...,8,16,9,7,6,56,1929,2002-03,1,[1929]
5,4,Valencia,82,3386,2664,1187,616,861,4398,3469,...,6,10,11,10,7,50,1931-32,1987-88,1,"[1931, 1932]"
6,5,Athletic Bilbao,86,3368,2762,1209,633,920,4631,3700,...,7,10,5,8,10,49,1929,1929,1,[1929]

In [288]:
### convering some categorical to numerical
cat_num=['Pos', 'Seasons', 'Points', 'GamesPlayed', 'GamesWon',
       'GamesDrawn', 'GamesLost', 'GoalsFor', 'GoalsAgainst', 'Champion',
       'Runner-up', 'Third', 'Fourth', 'Fifth', 'Sixth', 'T','BestPosition']
### pd.numeric will convert only one column to numeric  only one column at a time

In [290]:
df3[cat_num] = df3[cat_num].apply(pd.to_numeric)

In [309]:
df3['Points'].sort_values(ascending =False)     ### if data is not numeric it will throw an error hence convert the columns 
# into numeric

2     4385
3     4262
4     3442
5     3386
6     3368
      ...
58      34
59      22
60      19
61      14
62       0
Name: Points, Length: 61, dtype: int64

In [328]:
df3.sort_values(by = 'Points' ,ascending = False).loc[:,['Team' ,'Points'] ].head()

1             Team  Points
2      Real Madrid    4385
3        Barcelona    4262
4  Atletico Madrid    3442
5         Valencia    3386
6  Athletic Bilbao    3368

### 3. What is the distribution of the winning percentage for all teams? Which teams are in the top 5 in terms of winning percentage? (Winning percentage= (GamesWon / GamesPlayed)*100)

In [329]:
df3.columns

Index(['Pos', 'Team', 'Seasons', 'Points', 'GamesPlayed', 'GamesWon',
       'GamesDrawn', 'GamesLost', 'GoalsFor', 'GoalsAgainst', 'Champion',
       'Runner-up', 'Third', 'Fourth', 'Fifth', 'Sixth', 'T', 'Debut',
       'Since/LastApp', 'BestPosition', 'deb1'],
      dtype='object', name=1)

In [330]:
df3['wip'] = (df3['GamesWon']/df3['GamesPlayed'])*100

In [ ]:
### winnig percentage of each team

In [336]:
df3['wip'] = df3['wip'].fillna(0)
df3['wip']

2     59.630702
3     57.241130
4     47.475134
5     44.557057
6     43.772629
        ...
58    21.052632
59    23.333333
60    23.333333
61    16.666667
62     0.000000
Name: wip, Length: 61, dtype: float64

In [337]:
## top 5  acg to winnig percentage
df3.sort_values(by = 'wip' ,ascending = False).loc[: , ['Team' ,'wip']].head()

1             Team        wip
2      Real Madrid  59.630702
3        Barcelona  57.241130
4  Atletico Madrid  47.475134
5         Valencia  44.557057
6  Athletic Bilbao  43.772629

In [350]:
df3.sort_values(by = ['wip' ,'Team'] , ascending = [False ,False ])[['wip' ,'Team']].head()

1        wip             Team
2  59.630702      Real Madrid
3  57.241130        Barcelona
4  47.475134  Atletico Madrid
5  44.557057         Valencia
6  43.772629  Athletic Bilbao

### 4. Is there a significant difference in the winning percentage for teams which have attained a best position between 1-3 and those teams which have had a best position between 4-7.

In [352]:
df3.columns

Index(['Pos', 'Team', 'Seasons', 'Points', 'GamesPlayed', 'GamesWon',
       'GamesDrawn', 'GamesLost', 'GoalsFor', 'GoalsAgainst', 'Champion',
       'Runner-up', 'Third', 'Fourth', 'Fifth', 'Sixth', 'T', 'Debut',
       'Since/LastApp', 'BestPosition', 'deb1', 'wip'],
      dtype='object', name=1)

In [408]:
a = df3[(df3['BestPosition'] == 1) | (df3['BestPosition'] == 2) | (df3['BestPosition'] == 3)]
b = df3[(df3['BestPosition'] == 4) | (df3['BestPosition'] == 5) |
             (df3['BestPosition'] == 6) | (df3['BestPosition'] == 7)]

In [410]:
## ho = there is no effect of best position  on  winning  percentage
## h1 = there is an effect of best postion  in winning percentage
stats.ttest_ind(a['wip'] ,b['wip'])
## conclusion =  we reject null hypohesis  pvalue< alpha  hence  we reject null hypothesis ,  hence there is a impact of 
## best position on winning percentage

Ttest_indResult(statistic=4.992715339447283, pvalue=1.5362101870160483e-05)

### 2. A study was done to measure the blood pressure of 60 year old women with glaucoma. A random sample of 200 60-year old women with glaucoma was chosen. The mean of the systolic blood pressure in the sample was 140 mm Hg and the standard deviation was 25 mm Hg.

### a)	Calculate the estimated standard error of the sample mean? What does the standard error indicate?

### b)	Estimate a 95% confidence interval for the true mean blood pressure for all 60-year old women with glaucoma.

### c)	Assume that instead of 200, a random sample of only 100 60-year old women with glaucoma was chosen. The sample mean and standard deviation estimates are the same as those in the original study. What is the estimated 95% confidence interval for the true mean blood pressure?

### d)	Which of the two above intervals are wider?

### e)	Explain in non-technical terms why the estimated standard error of a sample mean tends to decrease with an increase in sample size.

In [377]:
n = 200
sampmean = 140
samsd = 25

### a) Calculate the estimated standard error of the sample mean? What does the standard error indicate?

In [379]:
###standard error = sampsd/np.sqrt(sampsd)
se = samsd/(np.sqrt(n))
se
### a sample mean deviates from the actual mean of a population—this deviation is the standard error of the mean.
## standard error  measures the accuracy with which sample distribution  represent population by using standard deviation

1.7677669529663687

### b) Estimate a 95% confidence interval for the true mean blood pressure for all 60-year old women with glaucoma

In [ ]:
### mean+- Z*standard error

In [381]:
z = stats.t.ppf(1-.05/2 ,199)
z

1.971956544249395

In [389]:
## class interval
a1 =140 + z*se   
b1 = 140  - z*se     
a1,b1

(143.48595961160984, 136.51404038839016)


### c) Assume that instead of 200, a random sample of only 100 60-year old women with glaucoma was chosen. The sample mean and standard deviation estimates are the same as those in the original study. What is the estimated 95% confidence interval for the true mean blood pressure?

In [384]:
##z1
z1 = stats.t.ppf(1-.05/2 ,99)
z1

1.9842169515086827

In [386]:
se1 = samsd/(np.sqrt(100))
se1

2.5

In [391]:
## class interval
a2 =140+z1*se1 
b2 =140-z1*se1
a2,b2

(144.96054237877172, 135.03945762122828)

### d) Which of the two above intervals are wider?¶

In [392]:
a1-b1 > a2-b2
## interval  with sample size of 100 is more wider

False

### e) Explain in non-technical terms why the estimated standard error of a sample mean tends to decrease with an increase in sample size.

In [ ]:
### as  the sample size increases chances  of error also decrease , its also because we have more number of datapoints as 
## compared to having a data with less sample size , 
## capturing od deviation is also larger in smaller sample size , but in large sample size we tend to  capture more more data 
### towards mean  hence less prpotionate deviation is captured

### Par Inc., is a major manufacturer of golf equipment. Management believes that Par’s market share could be increased with the introduction of a cut-resistant, longer-lasting golf ball. Therefore, the research group at Par has been investigating a new golf ball coating designed to resist cuts and provide a more durable ball. The tests with the coating have been promising.

### One of the researchers voiced concern about the effect of the new coating on driving distances. Par would like the new cut-resistant ball to offer driving distances comparable to those of the current-model golf ball. To compare the driving distances for the two balls, 40 balls of both the new and current models were subjected to distance tests. The testing was performed with a mechanical hitting machine so that any difference between the mean distances for the two models could be

 ### attributed to a difference in the design. The results of the tests, with distances measured to the nearest yard, are contained in   the data set “Golf”.

### 1.	Formulate and present the rationale for a hypothesis test that Par could use to compare the driving distances of the current and new golf balls.
### 2.	Analyze the data to provide the hypothesis testing conclusion. What is the p-value for your test? What is your recommendation for Par Inc.?
### 3.	What is the 95% confidence interval for the population mean of each model, and what is the 95% confidence interval for the difference between the means of the two population?

In [394]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 2 columns):
Current    40 non-null int64
New        40 non-null int64
dtypes: int64(2)
memory usage: 768.0 bytes

In [411]:
df1.head()

   Current  New
0      264  277
1      261  269
2      267  263
3      272  266
4      258  262

### 1. Formulate and present the rationale for a hypothesis test that Par could use to compare the driving distances of the current and new golf balls.

In [ ]:
### H0 = mean distance covered by old model and new model is same
### H1 = mean distance coverd by old model != mean distance covered by new model

In [ ]:
###df>30 hence data is normal  or lets just check for the normalcy

In [397]:
stats.shapiro(df1['Current'])  
###  pvlue> alpha(.05)  , hence we are failed to reject null hypothesis hence  current  column data is normal

(0.9707046747207642, 0.378787100315094)

In [398]:
stats.shapiro(df1['New']) 
## pvlue> alpha(.05)  , hence we are failed to reject null hypothesis hence  New  column data is normal

(0.9678263664245605, 0.3064655363559723)

### 2. Analyze the data to provide the hypothesis testing conclusion. What is the p-value for your test? What is your recommendation for Par Inc.?

In [ ]:
## here we are goimg to perform ttest_ind

In [421]:
stats.ttest_ind(df1['Current'] ,df1['New'])

Ttest_indResult(statistic=1.3283615935245678, pvalue=0.18793228491854663)

In [ ]:
### conclusion :- here we are fail to reject null hypothesis hence mean distance covered by both the ball is same
pvalue=0.18793228491854663
### my recomendation would be that they should use the new material

### 3. What is the 95% confidence interval for the population mean of each model, and what is the 95% confidence interval for the difference between the means of the two population?

In [ ]:
## 95% confidence interval

In [414]:
n = 40
mean1 =  np.mean(df1['Current'])
mean2 = np.mean(df1['New'])
sd1 = df1['Current'].std()
sd2 = df1['New'].std()
### z value is going to be same
z =stats.t.ppf(1-.05/2 , 39)

In [422]:
z ,sd1 ,sd2

(2.022690911734728, 8.752984838884597, 9.896904462947894)

In [425]:
se1 = sd1/np.sqrt(n)
se2  = sd2/np.sqrt(n)
## there is going to be two classes  for each population

#### differnce of class interval

In [434]:
cup = (mean1- mean2)+z*np.sqrt((sd1**2/ n) +(sd2**2/ n) )
clow = (mean1- mean2) - z*np.sqrt((sd1**2/ n) +(sd2**2/ n) )
cup,clow
### as lower interval is less than zero hence this interval is not very reliable

(7.000481455821679, -1.4504814558217243)